# -*- coding: utf-8 -*-
"""Программирование на Python.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1cY1k4t-41uW6fN9eIfPWHGlzXc3NH5y-

Катя узнала, что ей для сна надо X минут. В отличие от Коли, Катя ложится спать после полуночи в 
H часов и M минут. Помогите Кате определить, на какое время ей поставить будильник, чтобы он прозвенел ровно через X минут после того, как она ляжет спать.

На стандартный ввод, каждое в своей строке, подаются значения X, H и 
M. Гарантируется, что Катя должна проснуться в тот же день, что и заснуть. Программа должна выводить время, на которое нужно поставить будильник: в первой строке часы, во второй — минуты.
"""

x=int(input())
h=int(input())
m=int(input())

d=h*60+m+x
h=d/60
m=d%60

print(int(h))
print(int(m))

"""Из передачи “Здоровье” Аня узнала, что рекомендуется спать хотя бы A часов в сутки, но пересыпать тоже вредно и не стоит спать более B часов. Сейчас Аня спит H часов в сутки. Если режим сна Ани удовлетворяет рекомендациям передачи “Здоровье”, выведите “Это нормально”. Если Аня спит менее  A часов, выведите “Недосып”, если же более B часов, то выведите “Пересып”.
Получаемое число A всегда меньше либо равно B.

На вход программе в три строки подаются переменные в следующем порядке: A, B, H.

Обратите внимание на регистр символов: вывод должен в точности соответствовать описанному в задании, т. е. если программа должна вывести "Пересып", выводы программы "пересып", "ПЕРЕСЫП", "ПеРеСыП" и другие не будут считаться верными.

"""

a = int(input())
b = int(input())
h = int(input())
if a<=h<=b:
    print('Это нормально')
elif h<a:
    print('Недосып')
else:
    print('Пересып')

"""Требуется определить, является ли данный год високосным.

Напомним, что високосными годами считаются те годы, порядковый номер которых либо кратен 4, но при этом не кратен 100, либо кратен 400 (например, 2000-й год являлся високосным, а 2100-й будет невисокосным годом).

Программа должна корректно работать на числах 1900≤n≤3000.

Выведите "Високосный" в случае, если считанный год является високосным и "Обычный" в обратном случае (не забывайте проверять регистр выводимых программой символов).
"""

y=int(input())
if (y%4==0) and (y%100!= 0) or (y%400==0):
    print('Високосный')
else:
    print('Обычный')

"""В то далёкое время, когда Паша ходил в школу, ему очень не нравилась формула Герона для вычисления площади треугольника, так как казалась слишком сложной. В один прекрасный момент Павел решил избавить всех школьников от страданий и написать и распространить по школам программу, вычисляющую площадь треугольника по трём сторонам.

Одна проблема: так как эта формула не нравилась Павлу, он её не запомнил. Помогите ему завершить доброе дело и напишите программу, вычисляющую площадь треугольника по переданным длинам трёх его сторон по формуле Герона:

S= sqrt(p(p−a)(p−b)(p−c)), где p = (a+b+c)/2 – полупериметр треугольника. На вход программе подаются целые числа, выводом программы должно являться вещественное число, соответствующее площади треугольника.
"""

a=int(input())
b=int(input())
c=int(input())
p=(a+b+c)/2
S=(p*(p-a)*(p-b)*(p-c))**(1/2)
print(float(S))

"""Напишите программу, принимающую на вход целое число, которая выводит True, если переданное значение попадает в интервал 
(
−
15
,
12
]
∪
(
14
,
17
)
∪
[
19
,
+
∞
)
(−15,12]∪(14,17)∪[19,+∞) и False в противном случае (регистр символов имеет значение).
"""

a = int(input())
if -15<a<=12 or 14<a<17 or 19<=a:
    print(True)
else:
    print(False)

"""Напишите простой калькулятор, который считывает с пользовательского ввода три строки: первое число, второе число и операцию, после чего применяет операцию к введённым числам ("первое число" "операция" "второе число") и выводит результат на экран.

Поддерживаемые операции: +, -, /, *, mod, pow, div, где
mod — это взятие остатка от деления,
pow — возведение в степень,
div — целочисленное деление.

Если выполняется деление и второе число равно 0, необходимо выводить строку "Деление на 0!".

Обратите внимание, что на вход программе приходят вещественные числа.
"""

a = float(input())
b = float(input())
c = str(input())
if c=='+':
    print(a+b)
elif c=='-':
    print(a-b)
elif c=='/':
    if b==0:
        print("Деление на 0!")
    else:
        print(a/b)
elif c=='*':
    print(a*b)
elif c=='mod':
    if b==0:
        print("Деление на 0!")
    else:
        print(a%b)
elif c=='pow':
    print(a**b)
elif c=='div':
    if b==0:
        print("Деление на 0!")
    else:
        print(a//b)

"""Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.

Формат ввода, который используют Малевийцы:

треугольник
a
b
c
где a, b и c — длины сторон треугольника

прямоугольник
a
b
где a и b — длины сторон прямоугольника

круг
r
где r — радиус окружности
"""

i = str(input())
if i=='треугольник':
    a=int(input())
    b=int(input())
    c=int(input())
    p=(a+b+c)/2
    s=(p*(p-a)*(p-b)*(p-c))**(1/2)
    print(float(s))
elif i=='прямоугольник':
    a=int(input())
    b=int(input())
    s=a*b
    print(float(s))
elif i=='круг':
    r=int(input())
    s=3.14*r**2
    print(float(s))

"""Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное, потом минимальное, после чего оставшееся число.

На ввод могут подаваться и повторяющиеся числа.
"""

a=int(input())
b=int(input())
if (a<b):
    mn=a
    mx=b
else:
    mn=b
    mx=a
c=int(input())
if (c<=mn):
    mn=c
if (mx<=c):
    mx=c
av = a+b+c-mn-mx
print(mx)
print(mn)
print(av)

"""В институте биоинформатики по офису передвигается робот. Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату, считает количество программистов в ней и произносит его вслух: "n программистов".

Для того, чтобы это звучало правильно, для каждого n нужно использовать верное окончание слова.

Напишите программу, считывающую с пользовательского ввода целое число 
n (неотрицательное), выводящее это число в консоль вместе с правильным образом изменённым словом "программист", для того, чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.

В комнате может быть очень много программистов. Проверьте, что ваша программа правильно обработает все случаи, как минимум до 1000 человек.

Дополнительный комментарий к условию:
Обратите внимание, что задача не так проста, как кажется на первый взгляд. Если ваше решение не проходит какой-то тест, это значит, что вы не рассмотрели какой-то из случаев входных данных (число программистов 
0≤n≤1000). Обязательно проверяйте свои решения на дополнительных значениях, а не только на тех, что приведены в условии задания.

Так как задание повышенной сложности, вручную код решений проверяться не будет. Если вы столкнулись с ошибкой в первых четырёх тестах, проверьте, что вы используете только русские символы для ответа. В остальных случаях ищите ошибку в логике работы программы.
"""

n=int(input())

if 11<=n%100<=14:
    print(n,'программистов')

elif 2<=n%10<=4:
    print(n,'программиста')

elif n%10==1:
    print(n,'программист')    
     
else:
    print(n,'программистов')

"""Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета.

Однако Паша очень плохо считает в уме, поэтому попросил вас написать программу, которая проверит равенство сумм и выведет "Счастливый", если суммы совпадают, и "Обычный", если суммы различны.

На вход программе подаётся строка из шести цифр.

Выводить нужно только слово "Счастливый" или "Обычный", с большой буквы.
"""

a = int(str(input()))
i=a//1000
j=a%1000
x1=i//100
y1=(i-x1*100)//10
z1=i-x1*100-y1*10
x2=j//100
y2=(j-x2*100)//10
z2=j-x2*100-y2*10
if (x1+y1+z1==x2+y2+z2):
    print('Счастливый')
else:
    print('Обычный')

"""Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел."""

s=0
a=1
while a!=0:
    a=int(input())
    s+=a
print(s)

"""В Институте биоинформатики между информатиками и биологами устраивается соревнование. Победителям соревнования достанется большой и вкусный пирог. В команде биологов a человек, а в команде информатиков — b человек.

Нужно заранее разрезать пирог таким образом, чтобы можно было раздать кусочки пирога любой команде, выигравшей соревнование, при этом каждому участнику этой команды должно достаться одинаковое число кусочков пирога. И так как не хочется резать пирог на слишком мелкие кусочки, нужно найти минимальное подходящее число.

Напишите программу, которая помогает найти это число.
Программа должна считывать размеры команд (два положительных целых числа a и 
b, каждое число вводится на отдельной строке) и выводить наименьшее число d, которое делится на оба этих числа без остатка.
"""

a = int(input())
b = int(input())
d=1
while (d%a!=0 or d%b!=0):
    d+=1
print(d)

"""Напишите программу, которая считывает целые числа с консоли по одному числу в строке.

Для каждого введённого числа проверить:
если число меньше 10, то пропускаем это число;
если число больше 100, то прекращаем считывать числа;
в остальных случаях вывести это число обратно на консоль в отдельной строке.
"""

a=0
while a<=100:
    a=int(input())
    if a<10:
        continue
    if a>100:
        break
    print(a)

"""Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения.

Напишите программу, на вход которой даются четыре числа a, b, c и d, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a;b] на все числа отрезка [c;d].

Числа a, b, c и d являются натуральными и не превосходят 10, a≤b, c≤d.

Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции. Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.
"""

a=int(input())
b=int(input())
c=int(input())
d=int(input())
for k in range(c,d+1):
    print('\t',k,end='')
print('')
for i in range(a,b+1):
    print(i,end='\t')
    for j in range(c,d+1):
      print(i*j,end='\t')
    print('')

"""Напишите программу, которая считывает с клавиатуры два числа a и b, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a;b], которые кратны числу 3. На вход программе подаются интервалы, внутри которых всегда есть хотя бы одно число, которое делится на 3.﻿"""

a = int(input())
b = int(input())
s=0
k=0
for j in range(a,b+1):
    if j%3==0:
        s+=j
        k+=1
print(s/k)

"""GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности.

Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке (программа не должна зависеть от регистра вводимых символов).

Например, в строке "acggtgttat" процентное содержание символов G и C равно 
4/10⋅100 = 40.0, где 4 - это количество символов G и C,  а 10 - это длина строки.
"""

a = str(input()).upper()
gct=0
cct=0
for i in a:
    if i=='G':
        gct+=1
    if i=='C':
        cct+=1
print(100*(gct+cct)/len(a))

"""Узнав, что ДНК не является случайной строкой, только что поступившие в Институт биоинформатики студенты группы информатиков предложили использовать алгоритм сжатия, который сжимает повторяющиеся символы в строке.

Кодирование осуществляется следующим образом:
s = 'aaaabbсaa' преобразуется в 'a4b2с1a2', то есть группы одинаковых символов исходной строки заменяются на этот символ и количество его повторений в этой позиции строки.

Напишите программу, которая считывает строку, кодирует её предложенным алгоритмом и выводит закодированную последовательность на стандартный вывод. Кодирование должно учитывать регистр символов.
"""

s = str(input())
k=0
for i in range(0,len(s)-1):
    if s[i] == s[i+1]:
        k+=1
    else:
        print(s[i],k+1,sep='',end='')
        k=0
print(s[-1],k+1,sep='',end='')

"""Напишите программу, на вход которой подается одна строка с целыми числами. Программа должна вывести сумму этих чисел."""

a =[int(i) for i in input().split()]
s=0
for j in range(0,len(a)):
    s+= a[j]
print(s)

"""Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента этого списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей считается элемент, находящий на противоположном конце этого списка. Например, если на вход подаётся список "1 3 5 6 10", то на выход ожидается список "13 6 9 15 7" (без кавычек).

Если на вход пришло только одно число, надо вывести его же.

Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
"""

a=[int(i) for i in input().split()]
s=0
if len(a)==1:
    print(a[0])
else:
    for j in range(0, len(a)-1):
            s=a[j-1]+a[j+1]
            print(s,end=' ')
    print(a[-2]+a[0],end=' ')

"""Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения, которые встречаются в нём более одного раза.

Для решения задачи может пригодиться метод sort списка.

Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
"""

a = [int(i) for i in input().split()]
b = sorted(a)
new =[]   
for j in range(0,len(b)-1):
       if b[j]==b[j+1]:
          if b[j] not in new:
              new.append(b[j])
for k in new:
    print(k,end=' ')

"""Напишите программу, которая считывает с консоли числа (по одному в строке) до тех пор, пока сумма введённых чисел не будет равна 0 и сразу после этого выводит сумму квадратов всех считанных чисел.

Гарантируется, что в какой-то момент сумма введённых чисел окажется равной 0, после этого считывание продолжать не нужно.

В примере мы считываем числа 1, -3, 5, -6, -10, 13; в этот момент замечаем, что сумма этих чисел равна нулю и выводим сумму их квадратов, не обращая внимания на то, что остались ещё не прочитанные значения.
"""

new = []
s=0
b=0
while (b<1):
    a = int(input())
    s+=a
    new.append(a*a)
    if (s==0):
        break
print(sum(new))

"""Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число повторяется столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов последовательности должна отобразить программа. На выходе ожидается последовательность чисел, записанных через пробел в одну строку.

Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
"""

k = int(input())
s=[]
for i in range(1,k+1):
    s+=[i]*i
d=s[:k]
for i in range(len(d)):
    print(d[i],end=' ')

"""Напишите программу, которая считывает список чисел lst из первой строки и число x из второй строки, которая выводит все позиции, на которых встречается число 
x в переданном списке lst.

Позиции нумеруются с нуля, если число x не встречается в списке, вывести строку "Отсутствует" (без кавычек, с большой буквы).

Позиции должны быть выведены в одну строку, по возрастанию абсолютного значения.
"""

lst = [int(i) for i in input().split()]
x = int(input())

for i in range(0,len(lst)):
    if lst[i]==x:
       print(i, end=' ')
if x not in lst:
    print('Отсутствует')

"""Напишите программу, на вход которой подаётся прямоугольная матрица в виде последовательности строк. После последней строки матрицы идёт строка, содержащая только строку "end" (без кавычек, см. Sample Input).

Программа должна вывести матрицу того же размера, у которой каждый элемент в позиции i, j равен сумме элементов первой матрицы на позициях (i-1, j), (i+1, j), (i, j-1), (i, j+1). У крайних символов соседний элемент находится с противоположной стороны матрицы.

В случае одной строки/столбца элемент сам себе является соседом по соответствующему направлению.
"""

c = []
while True:
    b = input()
    if b == 'end':
        break
    a = [int(i) for i in b.split()]
    c.append(a)
n, m = len(c), len(c[0])
for i in range(n):
    for j in range(m):
        x = int(c[i][j-1]) + int(c[i][j+1-m]) + int(c[i-1][j]) + int(c[i+1-n][j])
        print(x, end=' ')
    print()

"""Выведите таблицу размером n×n, заполненную числами от 1 до n^2 по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке."""

n = int(input())
a = [[0 for i in range(n)] for j in range(n)]

i,j= 0,0
k=1
while k<=n**2:
    a[i][j]=k
    if (i<=j+1) and (i+j<n-1):
        j+=1
    elif (i<j) and (i+j>=n-1):
        i+=1
    elif (i>=j) and (i+j>n-1):
        j-=1
    else:
        i-=1
    k+=1
for i in range(n):
    for j in range(n):
        print(a[i][j],end=' ')
    print()

"""Когда Антон прочитал «Войну и мир», ему стало интересно, сколько слов и в каком количестве используется в этой книге.

Помогите Антону написать упрощённую версию такой программы, которая сможет подсчитать слова, разделённые пробелом и вывести получившуюся статистику.

Программа должна считывать одну строку со стандартного ввода и выводить для каждого уникального слова в этой строке число его повторений (без учёта регистра) в формате "слово количество" (см. пример вывода).
Порядок вывода слов может быть произвольным, каждое уникальное слово﻿ должно выводиться только один раз.
"""

a = input().lower().split()

b = {}
for i in a:
    j = a.count(i)
    if i not in b:
        b[i]=j
for key, values in b.items():
    print(key, values)